{"pages":[{"title":"Mingqiang Xu","text":"1Ocean University of China, 238 Songling Road, Laoshan District, Qingdao, China 2Visiting Research Fellow of Curtin University, Kent Street, Bentley, WA 6102, Australia Contact: xumingqiang@stu.ouc.edu.cn Research Interests: Offshore Engineering Structures, Structural Health Monitoring, Vibration‑based Damage Detection Academic QualificationsGraduated from Ocean University of China Qingdao, China B.Eng in Naval Architecture and Marine Engineering, June, 2014 M.Eng in Water Conservancy Engineering, June, 2017 Ph.D. in Harbor, Coastal and Offshore Engineering, June, 2020 Professional SkillsSoftwares: MATLAB, ANSYS, AQWA, SESAM Methods: Sensor placement, signal processing, modal identification and the model‑based damage detection methodsMathematical skills: optimization, sparse‑based regression analysis, machine learning, etc. Publications SQ Wang, HY Wang, MQ Xu*, J Guo. Identifying the presence of structural damage: A statistical hypothesis testing approach combined with residual strain energy. Mechanical Systems &amp; Signal Processing, 2020, 140. SQ Wang, YF Jiang, MQ Xu*. Structural damage identification using an iterative two‑stage method combining a modal energy based index with the BAS algorithm. Steel &amp; Composite Structures. 2020;36(1):31‑45. MQ Xu, SQ Wang, J Guo and YC Li. Robust structural damage detection using sensitivity analysis of CMSE system to damage. Applied Sciences‑Basel. 2020;10(8):2826. YF Jiang, SQ Wang, YC Li and MQ Xu. A novel multistage approach for structural model updating based on sensitivity ranking. Smart Structures &amp; Systems. 2020;25(6):657‑668. MQ Xu, SQ Wang and YF Jiang. Iterative two‑stage approach for identifying structural damage by combining the modal strain energy decomposition method with the multiobjective particle swarm optimization algorithm. Structural Control &amp; Health Monitoring. 2019;26(2):2301. MQ Xu, SQ Wang and HJ Li. A residual strain energy based damage localisation method for offshore platforms under environmental variations. Ships &amp; Offshore Structures. 2019;14(7):747–754. SQ Wang, MQ Xu, ZP Xia and YC Li. A novel Tikhonov regularization‑based iterative method for structural damage identification of offshore platforms. Journal of Marine Science &amp; Technology. 2019; 24(2):575–592. SQ Wang and MQ Xu. Modal Strain Energy‑based Structural Damage Identification: A Review and Comparative Study. Structural Engineering International. 2019;29(2):234‑248. MQ Xu, YC Liu, YF Jiang and SQ Wang. Mode Selection for Offshore Platform Damage Identification Using CMSE Sensitivity. Proceedings of the ASME 2019 38th International Conference on Ocean, Offshore and Arctic Engineering, 2019, Glasgow, UK. MQ Xu and SQ Wang. Cross modal strain energy–based structural damage detection in the presence of noise effects. Advances in Mechanical Engineering. 2017;9(12):168781401774412.","link":"/Resume/index.html"}],"posts":[{"title":"title","text":"","link":"/2017/09/08/Myblog/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. My name is Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/08/26/hello-world/"},{"title":"title","text":"","link":"/2020/08/26/title/"}],"tags":[{"name":"标签1","slug":"标签1","link":"/tags/%E6%A0%87%E7%AD%BE1/"},{"name":"标签2","slug":"标签2","link":"/tags/%E6%A0%87%E7%AD%BE2/"}],"categories":[{"name":"Hexo教程","slug":"Hexo教程","link":"/categories/Hexo%E6%95%99%E7%A8%8B/"}]}