{"pages":[{"title":"Mingqiang Xu","text":"1Ocean University of China, 238 Songling Road, Laoshan District, Qingdao, China 2Visiting Research Fellow of Curtin University, Kent Street, Bentley, WA 6102, Australia Contact: xumingqiang@stu.ouc.edu.cn Research Interests: Offshore Engineering Structures, Structural Health Monitoring, Vibration‑based Damage Detection Academic QualificationsGraduated from Ocean University of China Qingdao, China B.Eng in Naval Architecture and Marine Engineering, June, 2014 M.Eng in Water Conservancy Engineering, June, 2017 Ph.D. in Harbor, Coastal and Offshore Engineering, June, 2020 Professional SkillsSoftwares: MATLAB, ANSYS, AQWA, SESAM Methods: Sensor placement, signal processing, modal identification and the model‑based damage detection methodsMathematical skills: optimization, sparse‑based regression analysis, machine learning, etc. Publications SQ Wang, HY Wang, MQ Xu*, J Guo. Identifying the presence of structural damage: A statistical hypothesis testing approach combined with residual strain energy. Mechanical Systems &amp; Signal Processing, 2020, 140. SQ Wang, YF Jiang, MQ Xu*. Structural damage identification using an iterative two‑stage method combining a modal energy based index with the BAS algorithm. Steel &amp; Composite Structures. 2020;36(1):31‑45. MQ Xu, SQ Wang, J Guo and YC Li. Robust structural damage detection using sensitivity analysis of CMSE system to damage. Applied Sciences‑Basel. 2020;10(8):2826. YF Jiang, SQ Wang, YC Li and MQ Xu. A novel multistage approach for structural model updating based on sensitivity ranking. Smart Structures &amp; Systems. 2020;25(6):657‑668. MQ Xu, SQ Wang and YF Jiang. Iterative two‑stage approach for identifying structural damage by combining the modal strain energy decomposition method with the multiobjective particle swarm optimization algorithm. Structural Control &amp; Health Monitoring. 2019;26(2):2301. MQ Xu, SQ Wang and HJ Li. A residual strain energy based damage localisation method for offshore platforms under environmental variations. Ships &amp; Offshore Structures. 2019;14(7):747–754. SQ Wang, MQ Xu, ZP Xia and YC Li. A novel Tikhonov regularization‑based iterative method for structural damage identification of offshore platforms. Journal of Marine Science &amp; Technology. 2019; 24(2):575–592. SQ Wang and MQ Xu. Modal Strain Energy‑based Structural Damage Identification: A Review and Comparative Study. Structural Engineering International. 2019;29(2):234‑248. MQ Xu, YC Liu, YF Jiang and SQ Wang. Mode Selection for Offshore Platform Damage Identification Using CMSE Sensitivity. Proceedings of the ASME 2019 38th International Conference on Ocean, Offshore and Arctic Engineering, 2019, Glasgow, UK. MQ Xu and SQ Wang. Cross modal strain energy–based structural damage detection in the presence of noise effects. Advances in Mechanical Engineering. 2017;9(12):168781401774412.","link":"/Resume/index.html"},{"title":"Mingqiang Xu","text":"2020SQ Wang, HY Wang, MQ Xu*, J Guo. Identifying the presence of structural damage: A statistical hypothesis testing approach combined with residual strain energy. Mechanical Systems &amp; Signal Processing, 2020, 140.","link":"/Publications/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. My name is Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/08/26/hello-world/"},{"title":"title","text":"","link":"/2020/08/26/title/"},{"title":"Linear Discriminant Analysis","text":"​ 本文对一种经典的降维方法线性判别分析（Linear Discriminant Analysis, 以下简称LDA）进行总结。LDA在模式识别领域（比如人脸识别，舰艇识别等图形图像识别领域）中有非常广泛的应用，因此我们有必要了解下它的算法原理。在学习LDA之前，有必要将其自然语言处理领域的LDA区别开来，在自然语言处理领域， LDA是隐含狄利克雷分布（Latent Dirichlet Allocation，简称LDA），他是一种处理文档的主题模型。我们本文只讨论线性判别分析，因此后面所有的LDA均指线性判别分析。 LDA基本原理​ LDA是一种监督学习的降维技术，也就是说它的数据集的每个样本是有类别输出的。这点和PCA不同。PCA是不考虑样本类别输出的无监督降维技术。LDA的思想可以用一句话概括，就是“投影后类内方差最小，类间方差最大”。什么意思呢？ 我们要将数据在低维度上进行投影，投影后希望每一种类别数据的投影点尽可能的接近，而不同类别的数据的类别中心之间的距离尽可能的大。 ​ 可能还是有点抽象，我们先看看最简单的情况。假设我们有两类数据 分别为红色和蓝色，如下图所示，这些数据特征是二维的，我们希望将这些数据投影到一维的一条直线，让每一种类别数据的投影点尽可能的接近，而红色和蓝色数据中心之间的距离尽可能的大。 ​ 上图中提供了两种投影方式，哪一种能更好的满足我们的标准呢？从直观上可以看出，右图要比左图的投影效果好，因为右图的黑色数据和蓝色数据各个较为集中，且类别之间的距离明显。左图则在边界处数据混杂。以上就是LDA的主要思想了，当然在实际应用中，我们的数据是多个类别的，我们的原始数据一般也是超过二维的，投影后的也一般不是直线，而是一个低维的超平面。在我们将上面直观的内容转化为可以度量的问题之前，我们先了解些必要的数学基础知识，这些在后面讲解具体LDA原理时会用到。 瑞利商​ 我们首先来看看瑞利商的定义。瑞利商是指这样的函数，$$ A $$","link":"/2020/09/02/Linear%20Discriminant%20Analysis/"}],"tags":[{"name":"线性判别分析","slug":"线性判别分析","link":"/tags/%E7%BA%BF%E6%80%A7%E5%88%A4%E5%88%AB%E5%88%86%E6%9E%90/"},{"name":"数据降维","slug":"数据降维","link":"/tags/%E6%95%B0%E6%8D%AE%E9%99%8D%E7%BB%B4/"},{"name":"机器学习","slug":"机器学习","link":"/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"}],"categories":[{"name":"线性判别分析","slug":"线性判别分析","link":"/categories/%E7%BA%BF%E6%80%A7%E5%88%A4%E5%88%AB%E5%88%86%E6%9E%90/"}]}